public/man/man1/setsid.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - setsid.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - setsid.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>setsid - run a program in a new session</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>setsid</strong> [options] <em>program</em> [/arguments/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>setsid</strong> runs a program in a new session. The command calls *fork*(2) if
already a process group leader. Otherwise, it executes a program in the
current process. This default behavior is possible to override by the
<strong>–fork</strong> option.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>-c</strong>, <strong>–ctty</strong></p>
<blockquote>
<p>Set the controlling terminal to the current one.</p>
</blockquote>
<p>
<strong>-f</strong>, <strong>–fork</strong></p>
<blockquote>
<p>Always create a new process.</p>
</blockquote>
<p>
<strong>-w</strong>, <strong>–wait</strong></p>
<blockquote>
<p>Wait for the execution of the program to end, and return the exit status
of this program as the exit status of <strong>setsid</strong>.</p>
</blockquote>
<p>
<strong>-V</strong>, <strong>–version</strong></p>
<blockquote>
<p>Display version information and exit.</p>
</blockquote>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Display help text and exit.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
AUTHORS
</h2>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*setsid*(2)</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
REPORTING BUGS
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>For bug reports, use the issue tracker at
&lt;<a href="https://github.com/util-linux/util-linux/issues">https://github.com/util-linux/util-linux/issues</a>&gt;.</p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
AVAILABILITY
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>The <strong>setsid</strong> command is part of the util-linux package which can be
downloaded from <em>Linux Kernel Archive</em>
&lt;<a href="https://www.kernel.org/pub/linux/utils/util-linux/">https://www.kernel.org/pub/linux/utils/util-linux/</a>&gt;.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
